{"config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 140, 200, 3], "input_dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "config": {"activity_regularizer": null, "name": "block1_conv1", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "config": {"activity_regularizer": null, "name": "block1_conv2", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "config": {"trainable": false, "name": "block1_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "config": {"activity_regularizer": null, "name": "block2_conv1", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "config": {"activity_regularizer": null, "name": "block2_conv2", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "config": {"trainable": false, "name": "block2_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "config": {"activity_regularizer": null, "name": "block3_conv1", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 256, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "config": {"activity_regularizer": null, "name": "block3_conv2", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 256, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "config": {"activity_regularizer": null, "name": "block3_conv3", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 256, "W_regularizer": null, "trainable": false, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "config": {"trainable": false, "name": "block3_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "config": {"activity_regularizer": null, "name": "block4_conv1", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "config": {"activity_regularizer": null, "name": "block4_conv2", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "config": {"activity_regularizer": null, "name": "block4_conv3", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "config": {"trainable": true, "name": "block4_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "config": {"activity_regularizer": null, "name": "block5_conv1", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "config": {"activity_regularizer": null, "name": "block5_conv2", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "config": {"activity_regularizer": null, "name": "block5_conv3", "border_mode": "same", "activation": "relu", "nb_col": 3, "bias": true, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "config": {"trainable": true, "name": "block5_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0]]], "name": "globalaveragepooling2d_1", "config": {"trainable": true, "dim_ordering": "tf", "name": "globalaveragepooling2d_1"}, "class_name": "GlobalAveragePooling2D"}, {"inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "name": "dense_1", "config": {"activity_regularizer": null, "name": "dense_1", "activation": "elu", "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1024, "b_constraint": null, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "config": {"activity_regularizer": null, "name": "dense_2", "activation": "elu", "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 512, "b_constraint": null, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3", "config": {"activity_regularizer": null, "name": "dense_3", "activation": "elu", "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 128, "b_constraint": null, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_4", "config": {"activity_regularizer": null, "name": "dense_4", "activation": "elu", "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 32, "b_constraint": null, "init": "glorot_uniform", "input_dim": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_4", 0, 0]]], "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_5", "config": {"activity_regularizer": null, "name": "dense_5", "activation": "linear", "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1, "b_constraint": null, "init": "zero", "input_dim": null}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_2", "output_layers": [["dense_5", 0, 0]]}, "keras_version": "1.1.2", "class_name": "Model"}